{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\Problem_set_2_log.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}22 Feb 2019, 11:35:38

{com}. do "\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\cps_18.do"
{txt}
{com}. * NOTE: You need to set the Stata working directory to the path
. * where the data file is located.
. 
. set more off
{txt}
{com}. 
. clear
{txt}
{com}. quietly infix               ///
>   byte    age        63-64  ///
>   byte    sex        65-65  ///
>   int     race       66-68  ///
>   int     uhrsworkt  69-71  ///
>   int     educ       72-74  ///
>   byte    wkswork1   75-76  ///
>   long    incwage    77-83  ///
>   using "\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\cps_18.dat"
{txt}
{com}. 
. label var age       `"Age"'
{txt}
{com}. label var sex       `"Sex"'
{txt}
{com}. label var race      `"Race"'
{txt}
{com}. label var uhrsworkt `"Hours usually worked per week at all jobs"'
{txt}
{com}. label var educ      `"Educational attainment recode"'
{txt}
{com}. label var wkswork1  `"Weeks worked last year"'
{txt}
{com}. label var incwage   `"Wage and salary income"'
{txt}
{com}. 
. label define age_lbl 00 `"Under 1 year"'
{txt}
{com}. label define age_lbl 01 `"1"', add
{txt}
{com}. label define age_lbl 02 `"2"', add
{txt}
{com}. label define age_lbl 03 `"3"', add
{txt}
{com}. label define age_lbl 04 `"4"', add
{txt}
{com}. label define age_lbl 05 `"5"', add
{txt}
{com}. label define age_lbl 06 `"6"', add
{txt}
{com}. label define age_lbl 07 `"7"', add
{txt}
{com}. label define age_lbl 08 `"8"', add
{txt}
{com}. label define age_lbl 09 `"9"', add
{txt}
{com}. label define age_lbl 10 `"10"', add
{txt}
{com}. label define age_lbl 11 `"11"', add
{txt}
{com}. label define age_lbl 12 `"12"', add
{txt}
{com}. label define age_lbl 13 `"13"', add
{txt}
{com}. label define age_lbl 14 `"14"', add
{txt}
{com}. label define age_lbl 15 `"15"', add
{txt}
{com}. label define age_lbl 16 `"16"', add
{txt}
{com}. label define age_lbl 17 `"17"', add
{txt}
{com}. label define age_lbl 18 `"18"', add
{txt}
{com}. label define age_lbl 19 `"19"', add
{txt}
{com}. label define age_lbl 20 `"20"', add
{txt}
{com}. label define age_lbl 21 `"21"', add
{txt}
{com}. label define age_lbl 22 `"22"', add
{txt}
{com}. label define age_lbl 23 `"23"', add
{txt}
{com}. label define age_lbl 24 `"24"', add
{txt}
{com}. label define age_lbl 25 `"25"', add
{txt}
{com}. label define age_lbl 26 `"26"', add
{txt}
{com}. label define age_lbl 27 `"27"', add
{txt}
{com}. label define age_lbl 28 `"28"', add
{txt}
{com}. label define age_lbl 29 `"29"', add
{txt}
{com}. label define age_lbl 30 `"30"', add
{txt}
{com}. label define age_lbl 31 `"31"', add
{txt}
{com}. label define age_lbl 32 `"32"', add
{txt}
{com}. label define age_lbl 33 `"33"', add
{txt}
{com}. label define age_lbl 34 `"34"', add
{txt}
{com}. label define age_lbl 35 `"35"', add
{txt}
{com}. label define age_lbl 36 `"36"', add
{txt}
{com}. label define age_lbl 37 `"37"', add
{txt}
{com}. label define age_lbl 38 `"38"', add
{txt}
{com}. label define age_lbl 39 `"39"', add
{txt}
{com}. label define age_lbl 40 `"40"', add
{txt}
{com}. label define age_lbl 41 `"41"', add
{txt}
{com}. label define age_lbl 42 `"42"', add
{txt}
{com}. label define age_lbl 43 `"43"', add
{txt}
{com}. label define age_lbl 44 `"44"', add
{txt}
{com}. label define age_lbl 45 `"45"', add
{txt}
{com}. label define age_lbl 46 `"46"', add
{txt}
{com}. label define age_lbl 47 `"47"', add
{txt}
{com}. label define age_lbl 48 `"48"', add
{txt}
{com}. label define age_lbl 49 `"49"', add
{txt}
{com}. label define age_lbl 50 `"50"', add
{txt}
{com}. label define age_lbl 51 `"51"', add
{txt}
{com}. label define age_lbl 52 `"52"', add
{txt}
{com}. label define age_lbl 53 `"53"', add
{txt}
{com}. label define age_lbl 54 `"54"', add
{txt}
{com}. label define age_lbl 55 `"55"', add
{txt}
{com}. label define age_lbl 56 `"56"', add
{txt}
{com}. label define age_lbl 57 `"57"', add
{txt}
{com}. label define age_lbl 58 `"58"', add
{txt}
{com}. label define age_lbl 59 `"59"', add
{txt}
{com}. label define age_lbl 60 `"60"', add
{txt}
{com}. label define age_lbl 61 `"61"', add
{txt}
{com}. label define age_lbl 62 `"62"', add
{txt}
{com}. label define age_lbl 63 `"63"', add
{txt}
{com}. label define age_lbl 64 `"64"', add
{txt}
{com}. label define age_lbl 65 `"65"', add
{txt}
{com}. label define age_lbl 66 `"66"', add
{txt}
{com}. label define age_lbl 67 `"67"', add
{txt}
{com}. label define age_lbl 68 `"68"', add
{txt}
{com}. label define age_lbl 69 `"69"', add
{txt}
{com}. label define age_lbl 70 `"70"', add
{txt}
{com}. label define age_lbl 71 `"71"', add
{txt}
{com}. label define age_lbl 72 `"72"', add
{txt}
{com}. label define age_lbl 73 `"73"', add
{txt}
{com}. label define age_lbl 74 `"74"', add
{txt}
{com}. label define age_lbl 75 `"75"', add
{txt}
{com}. label define age_lbl 76 `"76"', add
{txt}
{com}. label define age_lbl 77 `"77"', add
{txt}
{com}. label define age_lbl 78 `"78"', add
{txt}
{com}. label define age_lbl 79 `"79"', add
{txt}
{com}. label define age_lbl 80 `"80"', add
{txt}
{com}. label define age_lbl 81 `"81"', add
{txt}
{com}. label define age_lbl 82 `"82"', add
{txt}
{com}. label define age_lbl 83 `"83"', add
{txt}
{com}. label define age_lbl 84 `"84"', add
{txt}
{com}. label define age_lbl 85 `"85"', add
{txt}
{com}. label define age_lbl 86 `"86"', add
{txt}
{com}. label define age_lbl 87 `"87"', add
{txt}
{com}. label define age_lbl 88 `"88"', add
{txt}
{com}. label define age_lbl 89 `"89"', add
{txt}
{com}. label define age_lbl 90 `"90 (90+, 1988-2002)"', add
{txt}
{com}. label define age_lbl 91 `"91"', add
{txt}
{com}. label define age_lbl 92 `"92"', add
{txt}
{com}. label define age_lbl 93 `"93"', add
{txt}
{com}. label define age_lbl 94 `"94"', add
{txt}
{com}. label define age_lbl 95 `"95"', add
{txt}
{com}. label define age_lbl 96 `"96"', add
{txt}
{com}. label define age_lbl 97 `"97"', add
{txt}
{com}. label define age_lbl 98 `"98"', add
{txt}
{com}. label define age_lbl 99 `"99+"', add
{txt}
{com}. label values age age_lbl
{txt}
{com}. 
. label define sex_lbl 1 `"Male"'
{txt}
{com}. label define sex_lbl 2 `"Female"', add
{txt}
{com}. label define sex_lbl 9 `"NIU"', add
{txt}
{com}. label values sex sex_lbl
{txt}
{com}. 
. label define race_lbl 100 `"White"'
{txt}
{com}. label define race_lbl 200 `"Black/Negro"', add
{txt}
{com}. label define race_lbl 300 `"American Indian/Aleut/Eskimo"', add
{txt}
{com}. label define race_lbl 650 `"Asian or Pacific Islander"', add
{txt}
{com}. label define race_lbl 651 `"Asian only"', add
{txt}
{com}. label define race_lbl 652 `"Hawaiian/Pacific Islander only"', add
{txt}
{com}. label define race_lbl 700 `"Other (single) race, n.e.c."', add
{txt}
{com}. label define race_lbl 801 `"White-Black"', add
{txt}
{com}. label define race_lbl 802 `"White-American Indian"', add
{txt}
{com}. label define race_lbl 803 `"White-Asian"', add
{txt}
{com}. label define race_lbl 804 `"White-Hawaiian/Pacific Islander"', add
{txt}
{com}. label define race_lbl 805 `"Black-American Indian"', add
{txt}
{com}. label define race_lbl 806 `"Black-Asian"', add
{txt}
{com}. label define race_lbl 807 `"Black-Hawaiian/Pacific Islander"', add
{txt}
{com}. label define race_lbl 808 `"American Indian-Asian"', add
{txt}
{com}. label define race_lbl 809 `"Asian-Hawaiian/Pacific Islander"', add
{txt}
{com}. label define race_lbl 810 `"White-Black-American Indian"', add
{txt}
{com}. label define race_lbl 811 `"White-Black-Asian"', add
{txt}
{com}. label define race_lbl 812 `"White-American Indian-Asian"', add
{txt}
{com}. label define race_lbl 813 `"White-Asian-Hawaiian/Pacific Islander"', add
{txt}
{com}. label define race_lbl 814 `"White-Black-American Indian-Asian"', add
{txt}
{com}. label define race_lbl 815 `"American Indian-Hawaiian/Pacific Islander"', add
{txt}
{com}. label define race_lbl 816 `"White-Black--Hawaiian/Pacific Islander"', add
{txt}
{com}. label define race_lbl 817 `"White-American Indian-Hawaiian/Pacific Islander"', add
{txt}
{com}. label define race_lbl 818 `"Black-American Indian-Asian"', add
{txt}
{com}. label define race_lbl 819 `"White-American Indian-Asian-Hawaiian/Pacific Islander"', add
{txt}
{com}. label define race_lbl 820 `"Two or three races, unspecified"', add
{txt}
{com}. label define race_lbl 830 `"Four or five races, unspecified"', add
{txt}
{com}. label define race_lbl 999 `"Blank"', add
{txt}
{com}. label values race race_lbl
{txt}
{com}. 
. label define uhrsworkt_lbl 997 `"Hours vary"'
{txt}
{com}. label define uhrsworkt_lbl 999 `"NIU"', add
{txt}
{com}. label values uhrsworkt uhrsworkt_lbl
{txt}
{com}. 
. label define educ_lbl 000 `"NIU or no schooling"'
{txt}
{com}. label define educ_lbl 001 `"NIU or blank"', add
{txt}
{com}. label define educ_lbl 002 `"None or preschool"', add
{txt}
{com}. label define educ_lbl 010 `"Grades 1, 2, 3, or 4"', add
{txt}
{com}. label define educ_lbl 011 `"Grade 1"', add
{txt}
{com}. label define educ_lbl 012 `"Grade 2"', add
{txt}
{com}. label define educ_lbl 013 `"Grade 3"', add
{txt}
{com}. label define educ_lbl 014 `"Grade 4"', add
{txt}
{com}. label define educ_lbl 020 `"Grades 5 or 6"', add
{txt}
{com}. label define educ_lbl 021 `"Grade 5"', add
{txt}
{com}. label define educ_lbl 022 `"Grade 6"', add
{txt}
{com}. label define educ_lbl 030 `"Grades 7 or 8"', add
{txt}
{com}. label define educ_lbl 031 `"Grade 7"', add
{txt}
{com}. label define educ_lbl 032 `"Grade 8"', add
{txt}
{com}. label define educ_lbl 040 `"Grade 9"', add
{txt}
{com}. label define educ_lbl 050 `"Grade 10"', add
{txt}
{com}. label define educ_lbl 060 `"Grade 11"', add
{txt}
{com}. label define educ_lbl 070 `"Grade 12"', add
{txt}
{com}. label define educ_lbl 071 `"12th grade, no diploma"', add
{txt}
{com}. label define educ_lbl 072 `"12th grade, diploma unclear"', add
{txt}
{com}. label define educ_lbl 073 `"High school diploma or equivalent"', add
{txt}
{com}. label define educ_lbl 080 `"1 year of college"', add
{txt}
{com}. label define educ_lbl 081 `"Some college but no degree"', add
{txt}
{com}. label define educ_lbl 090 `"2 years of college"', add
{txt}
{com}. label define educ_lbl 091 `"Associate's degree, occupational/vocational program"', add
{txt}
{com}. label define educ_lbl 092 `"Associate's degree, academic program"', add
{txt}
{com}. label define educ_lbl 100 `"3 years of college"', add
{txt}
{com}. label define educ_lbl 110 `"4 years of college"', add
{txt}
{com}. label define educ_lbl 111 `"Bachelor's degree"', add
{txt}
{com}. label define educ_lbl 120 `"5+ years of college"', add
{txt}
{com}. label define educ_lbl 121 `"5 years of college"', add
{txt}
{com}. label define educ_lbl 122 `"6+ years of college"', add
{txt}
{com}. label define educ_lbl 123 `"Master's degree"', add
{txt}
{com}. label define educ_lbl 124 `"Professional school degree"', add
{txt}
{com}. label define educ_lbl 125 `"Doctorate degree"', add
{txt}
{com}. label define educ_lbl 999 `"Missing/Unknown"', add
{txt}
{com}. label values educ educ_lbl
{txt}
{com}. 
. save "\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\cps_18",replace
{txt}file \\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\cps_18.dta saved

{com}. 
{txt}end of do-file

{com}. do "\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\Problem_set_2_do.do"
{txt}
{com}. ###Problem Set 2####
{err}Unknown #command
{com}. ###tsb962###
{err}Unknown #command
{com}. ###this is after loading the CPS data and running the do file for it###
{err}Unknown #command
{com}. ###Q2###
{err}Unknown #command
{com}. use "\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\cps_18.dta", clear
{txt}
{com}. d

{txt}Contains data from {res}\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\cps_18.dta
{txt}  obs:{res}        91,928                          
{txt} vars:{res}             7                          22 Feb 2019 11:36
{txt} size:{res}     1,195,064                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:age            }{txt}{bind: byte    }{bind:{txt}%19.0g    }{space 1}{bind:age_lbl  }{bind:  }{res}{res}Age{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:sex_lbl  }{bind:  }{res}{res}Sex{p_end}
{p 0 48}{bind:race           }{txt}{bind: int     }{bind:{txt}%53.0g    }{space 1}{bind:race_lbl }{bind:  }{res}{res}Race{p_end}
{p 0 48}{bind:uhrsworkt      }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{txt}uhrsworkt_lbl{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Hours usually worked per week at all jobs{p_end}
{p 0 48}{bind:educ           }{txt}{bind: int     }{bind:{txt}%51.0g    }{space 1}{bind:educ_lbl }{bind:  }{res}{res}Educational attainment recode{p_end}
{p 0 48}{bind:wkswork1       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Weeks worked last year{p_end}
{p 0 48}{bind:incwage        }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Wage and salary income{p_end}
{txt}{hline}
Sorted by: 

{com}. gen lwage2 = log(incwage / (uhrsworkt * wkswork1)) 
{txt}(23,286 missing values generated)

{com}. gen white = 0
{txt}
{com}. replace white = 1 if race == 100
{txt}(70,546 real changes made)

{com}. gen black = 0
{txt}
{com}. replace black = 1 if race == 200
{txt}(11,299 real changes made)

{com}. gen other = 0
{txt}
{com}. replace other = 1 if race != 100 & race != 200
{txt}(10,083 real changes made)

{com}. 
. label list educ_lbl
{txt}educ_lbl:
{res}           0 NIU or no schooling
           1 NIU or blank
           2 None or preschool
          10 Grades 1, 2, 3, or 4
          11 Grade 1
          12 Grade 2
          13 Grade 3
          14 Grade 4
          20 Grades 5 or 6
          21 Grade 5
          22 Grade 6
          30 Grades 7 or 8
          31 Grade 7
          32 Grade 8
          40 Grade 9
          50 Grade 10
          60 Grade 11
          70 Grade 12
          71 12th grade, no diploma
          72 12th grade, diploma unclear
          73 High school diploma or equivalent
          80 1 year of college
          81 Some college but no degree
          90 2 years of college
          91 Associate's degree, occupational/vocational program
          92 Associate's degree, academic program
         100 3 years of college
         110 4 years of college
         111 Bachelor's degree
         120 5+ years of college
         121 5 years of college
         122 6+ years of college
         123 Master's degree
         124 Professional school degree
         125 Doctorate degree
         999 Missing/Unknown
{txt}
{com}. gen educ_new = 0
{txt}
{com}. replace educ_new = 0 if educ == 0 | educ == 1 | educ == 2 | educ == 999
{txt}(0 real changes made)

{com}. replace educ_new = 1 if educ == 11 
{txt}(0 real changes made)

{com}. replace educ_new = 2 if educ == 12
{txt}(0 real changes made)

{com}. replace educ_new = 2.5 if educ == 10
{txt}(481 real changes made)

{com}. replace educ_new = 3 if educ == 13
{txt}(0 real changes made)

{com}. replace educ_new = 4 if educ == 14
{txt}(0 real changes made)

{com}. replace educ_new = 5 if educ == 21
{txt}(0 real changes made)

{com}. replace educ_new = 5.5 if educ == 20
{txt}(1,357 real changes made)

{com}. replace educ_new = 6 if educ == 22
{txt}(0 real changes made)

{com}. replace educ_new = 7 if educ == 31
{txt}(0 real changes made)

{com}. replace educ_new = 7.5 if educ == 30
{txt}(1,212 real changes made)

{com}. replace educ_new = 8 if educ == 32
{txt}(0 real changes made)

{com}. replace educ_new = 9 if educ == 40
{txt}(1,355 real changes made)

{com}. replace educ_new = 10 if educ == 50
{txt}(1,353 real changes made)

{com}. replace educ_new = 11 if educ == 60
{txt}(1,761 real changes made)

{com}. replace educ_new = 12 if educ == 70 | educ == 71 | educ == 72 | educ == 73
{txt}(26,392 real changes made)

{com}. replace educ_new = 13 if educ == 80
{txt}(0 real changes made)

{com}. replace educ_new = 14 if educ == 81 | educ == 90 | educ == 91 | educ == 92
{txt}(24,925 real changes made)

{com}. replace educ_new = 15 if educ == 100
{txt}(0 real changes made)

{com}. replace educ_new = 16 if educ == 110 | educ == 111
{txt}(20,979 real changes made)

{com}. replace educ_new = 17 if educ == 120 | educ == 121
{txt}(0 real changes made)

{com}. replace educ_new = 18 if educ == 122 | educ == 123 | educ == 124
{txt}(10,066 real changes made)

{com}. replace educ_new = 21 if educ == 125
{txt}(1,799 real changes made)

{com}. 
. gen pot_exper = age - educ_new - 5
{txt}
{com}. gen pot_exper_sq = (age - educ_new - 5)^2
{txt}
{com}. 
. drop if wkswork1 < 50 
{txt}(30,178 observations deleted)

{com}. drop if uhrsworkt < 35 
{txt}(5,377 observations deleted)

{com}. drop if uhrsworkt == 997 
{txt}(3,175 observations deleted)

{com}. drop if uhrsworkt == 999
{txt}(1,919 observations deleted)

{com}. 
. sum

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}     51,279    43.40857    10.62824         25         64
{txt}{space 9}sex {c |}{res}     51,279    1.438679    .4962303          1          2
{txt}{space 8}race {c |}{res}     51,279    169.3557    170.9849        100        830
{txt}{space 3}uhrsworkt {c |}{res}     51,279     43.4963    8.055098         35        170
{txt}{space 8}educ {c |}{res}     51,279    92.10761    23.34645          2        125
{txt}{hline 13}{c +}{hline 57}
{space 4}wkswork1 {c |}{res}     51,279    51.95014    .3004702         50         52
{txt}{space 5}incwage {c |}{res}     51,279    64346.03    75274.01          0    1609999
{txt}{space 6}lwage2 {c |}{res}     49,153    3.125093    .7316781  -6.253829   6.428477
{txt}{space 7}white {c |}{res}     51,279    .7766337    .4165059          0          1
{txt}{space 7}black {c |}{res}     51,279    .1155054     .319634          0          1
{txt}{hline 13}{c +}{hline 57}
{space 7}other {c |}{res}     51,279    .1078609    .3102077          0          1
{txt}{space 4}educ_new {c |}{res}     51,279    14.36467    2.776208          0         21
{txt}{space 3}pot_exper {c |}{res}     51,279     24.0439    11.09045         -1         58
{txt}pot_exper_sq {c |}{res}     51,279    701.1048    563.6173          0       3364
{txt}
{com}. 
. table sex, nolabel
{err}option {bf:nolabel} not allowed
{txt}{search r(198), local:r(198);}

end of do-file

{search r(198), local:r(198);}

{com}. do "C:\Users\tsb962\AppData\Local\Temp\168\STD27de8_000000.tmp"
{txt}
{com}. ###Problem Set 2####
{err}Unknown #command
{com}. ###tsb962###
{err}Unknown #command
{com}. ###this is after loading the CPS data and running the do file for it###
{err}Unknown #command
{com}. ###Q2###
{err}Unknown #command
{com}. use "\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\cps_18.dta", clear
{txt}
{com}. d

{txt}Contains data from {res}\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\cps_18.dta
{txt}  obs:{res}        91,928                          
{txt} vars:{res}             7                          22 Feb 2019 11:36
{txt} size:{res}     1,195,064                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:age            }{txt}{bind: byte    }{bind:{txt}%19.0g    }{space 1}{bind:age_lbl  }{bind:  }{res}{res}Age{p_end}
{p 0 48}{bind:sex            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:sex_lbl  }{bind:  }{res}{res}Sex{p_end}
{p 0 48}{bind:race           }{txt}{bind: int     }{bind:{txt}%53.0g    }{space 1}{bind:race_lbl }{bind:  }{res}{res}Race{p_end}
{p 0 48}{bind:uhrsworkt      }{txt}{bind: int     }{bind:{txt}%10.0g    }{space 1}{txt}uhrsworkt_lbl{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}Hours usually worked per week at all jobs{p_end}
{p 0 48}{bind:educ           }{txt}{bind: int     }{bind:{txt}%51.0g    }{space 1}{bind:educ_lbl }{bind:  }{res}{res}Educational attainment recode{p_end}
{p 0 48}{bind:wkswork1       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}Weeks worked last year{p_end}
{p 0 48}{bind:incwage        }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{bind:         }{bind:  }{res}{res}Wage and salary income{p_end}
{txt}{hline}
Sorted by: 

{com}. gen lwage2 = log(incwage / (uhrsworkt * wkswork1)) 
{txt}(23,286 missing values generated)

{com}. gen white = 0
{txt}
{com}. replace white = 1 if race == 100
{txt}(70,546 real changes made)

{com}. gen black = 0
{txt}
{com}. replace black = 1 if race == 200
{txt}(11,299 real changes made)

{com}. gen other = 0
{txt}
{com}. replace other = 1 if race != 100 & race != 200
{txt}(10,083 real changes made)

{com}. 
. label list educ_lbl
{txt}educ_lbl:
{res}           0 NIU or no schooling
           1 NIU or blank
           2 None or preschool
          10 Grades 1, 2, 3, or 4
          11 Grade 1
          12 Grade 2
          13 Grade 3
          14 Grade 4
          20 Grades 5 or 6
          21 Grade 5
          22 Grade 6
          30 Grades 7 or 8
          31 Grade 7
          32 Grade 8
          40 Grade 9
          50 Grade 10
          60 Grade 11
          70 Grade 12
          71 12th grade, no diploma
          72 12th grade, diploma unclear
          73 High school diploma or equivalent
          80 1 year of college
          81 Some college but no degree
          90 2 years of college
          91 Associate's degree, occupational/vocational program
          92 Associate's degree, academic program
         100 3 years of college
         110 4 years of college
         111 Bachelor's degree
         120 5+ years of college
         121 5 years of college
         122 6+ years of college
         123 Master's degree
         124 Professional school degree
         125 Doctorate degree
         999 Missing/Unknown
{txt}
{com}. gen educ_new = 0
{txt}
{com}. replace educ_new = 0 if educ == 0 | educ == 1 | educ == 2 | educ == 999
{txt}(0 real changes made)

{com}. replace educ_new = 1 if educ == 11 
{txt}(0 real changes made)

{com}. replace educ_new = 2 if educ == 12
{txt}(0 real changes made)

{com}. replace educ_new = 2.5 if educ == 10
{txt}(481 real changes made)

{com}. replace educ_new = 3 if educ == 13
{txt}(0 real changes made)

{com}. replace educ_new = 4 if educ == 14
{txt}(0 real changes made)

{com}. replace educ_new = 5 if educ == 21
{txt}(0 real changes made)

{com}. replace educ_new = 5.5 if educ == 20
{txt}(1,357 real changes made)

{com}. replace educ_new = 6 if educ == 22
{txt}(0 real changes made)

{com}. replace educ_new = 7 if educ == 31
{txt}(0 real changes made)

{com}. replace educ_new = 7.5 if educ == 30
{txt}(1,212 real changes made)

{com}. replace educ_new = 8 if educ == 32
{txt}(0 real changes made)

{com}. replace educ_new = 9 if educ == 40
{txt}(1,355 real changes made)

{com}. replace educ_new = 10 if educ == 50
{txt}(1,353 real changes made)

{com}. replace educ_new = 11 if educ == 60
{txt}(1,761 real changes made)

{com}. replace educ_new = 12 if educ == 70 | educ == 71 | educ == 72 | educ == 73
{txt}(26,392 real changes made)

{com}. replace educ_new = 13 if educ == 80
{txt}(0 real changes made)

{com}. replace educ_new = 14 if educ == 81 | educ == 90 | educ == 91 | educ == 92
{txt}(24,925 real changes made)

{com}. replace educ_new = 15 if educ == 100
{txt}(0 real changes made)

{com}. replace educ_new = 16 if educ == 110 | educ == 111
{txt}(20,979 real changes made)

{com}. replace educ_new = 17 if educ == 120 | educ == 121
{txt}(0 real changes made)

{com}. replace educ_new = 18 if educ == 122 | educ == 123 | educ == 124
{txt}(10,066 real changes made)

{com}. replace educ_new = 21 if educ == 125
{txt}(1,799 real changes made)

{com}. 
. gen pot_exper = age - educ_new - 5
{txt}
{com}. gen pot_exper_sq = (age - educ_new - 5)^2
{txt}
{com}. 
. drop if wkswork1 < 50 
{txt}(30,178 observations deleted)

{com}. drop if uhrsworkt < 35 
{txt}(5,377 observations deleted)

{com}. drop if uhrsworkt == 997 
{txt}(3,175 observations deleted)

{com}. drop if uhrsworkt == 999
{txt}(1,919 observations deleted)

{com}. 
. sum

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}     51,279    43.40857    10.62824         25         64
{txt}{space 9}sex {c |}{res}     51,279    1.438679    .4962303          1          2
{txt}{space 8}race {c |}{res}     51,279    169.3557    170.9849        100        830
{txt}{space 3}uhrsworkt {c |}{res}     51,279     43.4963    8.055098         35        170
{txt}{space 8}educ {c |}{res}     51,279    92.10761    23.34645          2        125
{txt}{hline 13}{c +}{hline 57}
{space 4}wkswork1 {c |}{res}     51,279    51.95014    .3004702         50         52
{txt}{space 5}incwage {c |}{res}     51,279    64346.03    75274.01          0    1609999
{txt}{space 6}lwage2 {c |}{res}     49,153    3.125093    .7316781  -6.253829   6.428477
{txt}{space 7}white {c |}{res}     51,279    .7766337    .4165059          0          1
{txt}{space 7}black {c |}{res}     51,279    .1155054     .319634          0          1
{txt}{hline 13}{c +}{hline 57}
{space 7}other {c |}{res}     51,279    .1078609    .3102077          0          1
{txt}{space 4}educ_new {c |}{res}     51,279    14.36467    2.776208          0         21
{txt}{space 3}pot_exper {c |}{res}     51,279     24.0439    11.09045         -1         58
{txt}pot_exper_sq {c |}{res}     51,279    701.1048    563.6173          0       3364
{txt}
{com}. 
. table sex

{txt}{hline 10}{c TT}{hline 11}
      Sex {c |}      Freq.
{hline 10}{c +}{hline 11}
     Male {c |}     {res}28,784
   {txt}Female {c |}     {res}22,495
{txt}{hline 10}{c BT}{hline 11}

{com}. table race

{txt}{hline 39}{c TT}{hline 11}
                                  Race {c |}      Freq.
{hline 39}{c +}{hline 11}
                                 White {c |}     {res}39,825
                           {txt}Black/Negro {c |}      {res}5,923
          {txt}American Indian/Aleut/Eskimo {c |}        {res}634
                            {txt}Asian only {c |}      {res}3,717
        {txt}Hawaiian/Pacific Islander only {c |}        {res}268
                           {txt}White-Black {c |}        {res}191
                 {txt}White-American Indian {c |}        {res}342
                           {txt}White-Asian {c |}        {res}177
       {txt}White-Hawaiian/Pacific Islander {c |}         {res}38
                 {txt}Black-American Indian {c |}         {res}49
                           {txt}Black-Asian {c |}         {res}12
       {txt}Black-Hawaiian/Pacific Islander {c |}          {res}3
                 {txt}American Indian-Asian {c |}          {res}1
       {txt}Asian-Hawaiian/Pacific Islander {c |}         {res}37
           {txt}White-Black-American Indian {c |}         {res}34
                     {txt}White-Black-Asian {c |}          {res}1
           {txt}White-American Indian-Asian {c |}          {res}4
 {txt}White-Asian-Hawaiian/Pacific Islander {c |}         {res}15
     {txt}White-Black-American Indian-Asian {c |}          {res}2
{txt}White-Black--Hawaiian/Pacific Islander {c |}          {res}2
           {txt}Black-American Indian-Asian {c |}          {res}1
       {txt}Two or three races, unspecified {c |}          {res}1
       {txt}Four or five races, unspecified {c |}          {res}2
{txt}{hline 39}{c BT}{hline 11}

{com}. sum uhrsworkt, d

          {txt}Hours usually worked per week at all jobs
{hline 61}
      Percentiles      Smallest
 1%    {res}       35             35
{txt} 5%    {res}       38             35
{txt}10%    {res}       40             35       {txt}Obs         {res}     51,279
{txt}25%    {res}       40             35       {txt}Sum of Wgt. {res}     51,279

{txt}50%    {res}       40                      {txt}Mean          {res}  43.4963
                        {txt}Largest       Std. Dev.     {res} 8.055098
{txt}75%    {res}       45            139
{txt}90%    {res}       54            159       {txt}Variance      {res} 64.88461
{txt}95%    {res}       60            168       {txt}Skewness      {res} 2.978063
{txt}99%    {res}       80            170       {txt}Kurtosis      {res} 16.63883
{txt}
{com}. count if uhrsworkt == 999
  {res}0
{txt}
{com}. 
. ###Q3###
{err}Unknown #command
{com}. sum

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}     51,279    43.40857    10.62824         25         64
{txt}{space 9}sex {c |}{res}     51,279    1.438679    .4962303          1          2
{txt}{space 8}race {c |}{res}     51,279    169.3557    170.9849        100        830
{txt}{space 3}uhrsworkt {c |}{res}     51,279     43.4963    8.055098         35        170
{txt}{space 8}educ {c |}{res}     51,279    92.10761    23.34645          2        125
{txt}{hline 13}{c +}{hline 57}
{space 4}wkswork1 {c |}{res}     51,279    51.95014    .3004702         50         52
{txt}{space 5}incwage {c |}{res}     51,279    64346.03    75274.01          0    1609999
{txt}{space 6}lwage2 {c |}{res}     49,153    3.125093    .7316781  -6.253829   6.428477
{txt}{space 7}white {c |}{res}     51,279    .7766337    .4165059          0          1
{txt}{space 7}black {c |}{res}     51,279    .1155054     .319634          0          1
{txt}{hline 13}{c +}{hline 57}
{space 7}other {c |}{res}     51,279    .1078609    .3102077          0          1
{txt}{space 4}educ_new {c |}{res}     51,279    14.36467    2.776208          0         21
{txt}{space 3}pot_exper {c |}{res}     51,279     24.0439    11.09045         -1         58
{txt}pot_exper_sq {c |}{res}     51,279    701.1048    563.6173          0       3364
{txt}
{com}. reg lwage2 educ_new, beta

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    49,153
{txt}{hline 13}{c +}{hline 34}   F(1, 49151)     = {res}  8656.58
{txt}       Model {c |} {res} 3940.42379         1  3940.42379   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 22373.2386    49,151  .455193966   {txt}R-squared       ={res}    0.1497
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1497
{txt}       Total {c |} {res} 26313.6624    49,152  .535352833   {txt}Root MSE        =   {res} .67468

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      lwage2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 67}        Beta
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}educ_new {c |}{col 14}{res}{space 2} .1024975{col 26}{space 2} .0011016{col 37}{space 1}   93.04{col 46}{space 3}0.000{col 67}{space 3} .3869731
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  1.64932{col 26}{space 2} .0161509{col 37}{space 1}  102.12{col 46}{space 3}0.000{col 67}{space 3}        .
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. sum educ_new if !missing(lwage)

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 4}educ_new {c |}{res}     49,153    14.39813    2.762406          0         21
{txt}
{com}. display (2.762406)^2 * .1024975  /*###finds cov(x,y) using beta1 and variance of x###*/
{res}.78214683
{txt}
{com}. display .78214683 / (2.762406*.7316781)   /*###finds cor(x,y) using cov and st dev of x and y###*/
{res}.38697305
{txt}
{com}. display (.38697305)^2
{res}.14974814
{txt}
{com}. 
. ###Q4###
{err}Unknown #command
{com}. reg lwage2 educ_new pot_exper pot_exper_sq, r

{txt}Linear regression                               Number of obs     = {res}    49,153
                                                {txt}F(3, 49149)       =  {res}  2833.49
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.1665
                                                {txt}Root MSE          =    {res} .66802

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      lwage2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}educ_new {c |}{col 14}{res}{space 2} .1106212{col 26}{space 2} .0012136{col 37}{space 1}   91.15{col 46}{space 3}0.000{col 54}{space 4} .1082425{col 67}{space 3} .1129999
{txt}{space 3}pot_exper {c |}{col 14}{res}{space 2} .0240706{col 26}{space 2}  .001202{col 37}{space 1}   20.03{col 46}{space 3}0.000{col 54}{space 4} .0217147{col 67}{space 3} .0264265
{txt}pot_exper_sq {c |}{col 14}{res}{space 2}-.0003261{col 26}{space 2} .0000246{col 37}{space 1}  -13.24{col 46}{space 3}0.000{col 54}{space 4}-.0003744{col 67}{space 3}-.0002779
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.183549{col 26}{space 2} .0230662{col 37}{space 1}   51.31{col 46}{space 3}0.000{col 54}{space 4} 1.138339{col 67}{space 3} 1.228759
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ###Q5###
{err}Unknown #command
{com}. reg lwage2 educ_new pot_exper pot_exper_sq black other sex, r

{txt}Linear regression                               Number of obs     = {res}    49,153
                                                {txt}F(6, 49146)       =  {res}  1808.91
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2073
                                                {txt}Root MSE          =    {res} .65147

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      lwage2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}educ_new {c |}{col 14}{res}{space 2} .1147033{col 26}{space 2} .0012073{col 37}{space 1}   95.01{col 46}{space 3}0.000{col 54}{space 4} .1123371{col 67}{space 3} .1170695
{txt}{space 3}pot_exper {c |}{col 14}{res}{space 2} .0221582{col 26}{space 2} .0011789{col 37}{space 1}   18.80{col 46}{space 3}0.000{col 54}{space 4} .0198476{col 67}{space 3} .0244689
{txt}pot_exper_sq {c |}{col 14}{res}{space 2}-.0002862{col 26}{space 2} .0000242{col 37}{space 1}  -11.84{col 46}{space 3}0.000{col 54}{space 4}-.0003336{col 67}{space 3}-.0002388
{txt}{space 7}black {c |}{col 14}{res}{space 2}-.1664254{col 26}{space 2} .0093864{col 37}{space 1}  -17.73{col 46}{space 3}0.000{col 54}{space 4} -.184823{col 67}{space 3}-.1480279
{txt}{space 7}other {c |}{col 14}{res}{space 2} .0019869{col 26}{space 2} .0097729{col 37}{space 1}    0.20{col 46}{space 3}0.839{col 54}{space 4}-.0171681{col 67}{space 3} .0211419
{txt}{space 9}sex {c |}{col 14}{res}{space 2}-.2710042{col 26}{space 2} .0059426{col 37}{space 1}  -45.60{col 46}{space 3}0.000{col 54}{space 4}-.2826517{col 67}{space 3}-.2593566
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.553767{col 26}{space 2} .0235115{col 37}{space 1}   66.09{col 46}{space 3}0.000{col 54}{space 4} 1.507684{col 67}{space 3}  1.59985
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ###Q6###
{err}Unknown #command
{com}. test sex == black

{p 0 7}{space 1}{text:( 1)}{space 1}{space 1}{res}- black + sex = 0{p_end}

{txt}       F(  1, 49146) ={res}   84.41
{txt}{col 13}Prob > F ={res}    0.0000
{txt}
{com}. 
. ###Q7###
{err}Unknown #command
{com}. gen female = (sex ==2)
{txt}
{com}. gen male = (sex == 1)
{txt}
{com}. gen educ_male = educ_new * male 
{txt}
{com}. reg lwage2 educ_new pot_exper pot_exper_sq black other sex educ_male, r

{txt}Linear regression                               Number of obs     = {res}    49,153
                                                {txt}F(7, 49145)       =  {res}  1561.99
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2081
                                                {txt}Root MSE          =    {res} .65118

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}      lwage2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 4}educ_new {c |}{col 14}{res}{space 2} .1234821{col 26}{space 2} .0018334{col 37}{space 1}   67.35{col 46}{space 3}0.000{col 54}{space 4} .1198887{col 67}{space 3} .1270755
{txt}{space 3}pot_exper {c |}{col 14}{res}{space 2} .0222865{col 26}{space 2} .0011777{col 37}{space 1}   18.92{col 46}{space 3}0.000{col 54}{space 4} .0199782{col 67}{space 3} .0245948
{txt}pot_exper_sq {c |}{col 14}{res}{space 2}-.0002873{col 26}{space 2} .0000242{col 37}{space 1}  -11.89{col 46}{space 3}0.000{col 54}{space 4}-.0003346{col 67}{space 3}-.0002399
{txt}{space 7}black {c |}{col 14}{res}{space 2} -.165648{col 26}{space 2}  .009395{col 37}{space 1}  -17.63{col 46}{space 3}0.000{col 54}{space 4}-.1840623{col 67}{space 3}-.1472336
{txt}{space 7}other {c |}{col 14}{res}{space 2} .0034589{col 26}{space 2} .0097741{col 37}{space 1}    0.35{col 46}{space 3}0.723{col 54}{space 4}-.0156984{col 67}{space 3} .0226162
{txt}{space 9}sex {c |}{col 14}{res}{space 2}-.4816472{col 26}{space 2}  .034115{col 37}{space 1}  -14.12{col 46}{space 3}0.000{col 54}{space 4} -.548513{col 67}{space 3}-.4147814
{txt}{space 3}educ_male {c |}{col 14}{res}{space 2}-.0145493{col 26}{space 2} .0023407{col 37}{space 1}   -6.22{col 46}{space 3}0.000{col 54}{space 4}-.0191371{col 67}{space 3}-.0099615
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.843603{col 26}{space 2} .0522163{col 37}{space 1}   35.31{col 46}{space 3}0.000{col 54}{space 4} 1.741258{col 67}{space 3} 1.945948
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. nlcom (_b[educ_new] + _b[educ_male]) / _b[educ_new]

       {txt}_nl_1:  {res}(_b[educ_new] + _b[educ_male]) / _b[educ_new]

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      lwage2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2} .8821747{col 26}{space 2} .0176752{col 37}{space 1}   49.91{col 46}{space 3}0.000{col 54}{space 4} .8475319{col 67}{space 3} .9168175
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. nlcom _b[educ_new] / (_b[educ_new] + _b[educ_male])

       {txt}_nl_1:  {res}_b[educ_new] / (_b[educ_new] + _b[educ_male])

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}      lwage2{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 7}_nl_1 {c |}{col 14}{res}{space 2} 1.133562{col 26}{space 2}  .022712{col 37}{space 1}   49.91{col 46}{space 3}0.000{col 54}{space 4} 1.089048{col 67}{space 3} 1.178077
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. 
. ###Q8###
{err}Unknown #command
{com}. use "\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\nlsy79.dta", clear
{txt}
{com}. d

{txt}Contains data from {res}\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\nlsy79.dta
{txt}  obs:{res}         4,367                          
{txt} vars:{res}            17                          1 Feb 2012 11:26
{txt} size:{res}       131,010                          
{txt}{hline}
              storage   display    value
variable name   type    format     label      variable label
{hline}
{p 0 48}{res}{bind:age79          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0000600{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}age in 1979{p_end}
{p 0 48}{bind:foreign        }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0001100{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}foreign language spoken in childhood home{p_end}
{p 0 48}{bind:urban14        }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0001800{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}lived in town or city at age 14{p_end}
{p 0 48}{bind:mag14          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0002700{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}HH rec. magazines at age 14{p_end}
{p 0 48}{bind:news14         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0002800{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}HH rec. newspapers at age 14{p_end}
{p 0 48}{bind:lib14          }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0002900{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}HH had library card at age 14{p_end}
{p 0 48}{bind:educ_mom       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0006500{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}mom's highest grade{p_end}
{p 0 48}{bind:educ_dad       }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0007900{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}dad's highest grade{p_end}
{p 0 48}{bind:numsibs        }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0009100{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}number of siblings{p_end}
{p 0 48}{bind:selfesteem80   }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlR0304410{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}rothenberg self-esteem score in 1980{p_end}
{p 0 48}{bind:afqt81         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:         }{bind:  }{res}{res}AFQT score in 1981{p_end}
{p 0 48}{bind:laborinc07     }{txt}{bind: long    }{bind:{txt}%12.0g    }{space 1}{txt}vlT2076700{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}labor income in 2007{p_end}
{p 0 48}{bind:educ           }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{txt}vlT2210700{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}own highest grade{p_end}
{p 0 48}{bind:hours07        }{txt}{bind: int     }{bind:{txt}%8.0g     }{space 1}{txt}vlT2210900{p_end}
{p 0 48}{space 44}{bind:  }{res}{res}hours worked in 2007{p_end}
{p 0 48}{bind:black          }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}non-hispanic black{p_end}
{p 0 48}{bind:hisp           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}hispanic{p_end}
{p 0 48}{bind:male           }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}male{p_end}
{txt}{hline}
Sorted by: 

{com}. gen lwage = log(laborinc07 / hours07)
{txt}(974 missing values generated)

{com}. replace age79 = age79 + 28
{txt}(4,367 real changes made)

{com}. gen pot_exper = age79 - educ - 5
{txt}
{com}. sum pot_exper

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 3}pot_exper {c |}{res}      4,367    26.83032    3.363164         17         44
{txt}
{com}. gen pot_exper_sq = (pot_exper)^2
{txt}
{com}. drop if hours07 / 50 < 35
{txt}(1,430 observations deleted)

{com}. sum 

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 7}age79 {c |}{res}      2,937    45.50902    2.235916         42         50
{txt}{space 5}foreign {c |}{res}      2,937    .1399387    .3469825          0          1
{txt}{space 5}urban14 {c |}{res}      2,930    .7627986    .4254394          0          1
{txt}{space 7}mag14 {c |}{res}      2,922    .7046543    .4562761          0          1
{txt}{space 6}news14 {c |}{res}      2,930    .8607509    .3462654          0          1
{txt}{hline 13}{c +}{hline 57}
{space 7}lib14 {c |}{res}      2,929    .7534995    .4310469          0          1
{txt}{space 4}educ_mom {c |}{res}      2,805    11.73298    2.647974          0         20
{txt}{space 4}educ_dad {c |}{res}      2,705    12.00333    3.486712          0         20
{txt}{space 5}numsibs {c |}{res}      2,933    3.150699    2.144458          0         17
{txt}selfesteem80 {c |}{res}      2,837    22.74198    4.013514         10         30
{txt}{hline 13}{c +}{hline 57}
{space 6}afqt81 {c |}{res}      2,827    51.40149    28.03561          1         99
{txt}{space 2}laborinc07 {c |}{res}      2,843     60361.2     58932.3          0     307823
{txt}{space 8}educ {c |}{res}      2,937    13.91113    2.494804          0         20
{txt}{space 5}hours07 {c |}{res}      2,905    2383.738    527.7854       1750       6344
{txt}{space 7}black {c |}{res}      2,937    .1161049    .3204052          0          1
{txt}{hline 13}{c +}{hline 57}
{space 8}hisp {c |}{res}      2,937    .0674157    .2507833          0          1
{txt}{space 8}male {c |}{res}      2,937    .5529452    .4972736          0          1
{txt}{space 7}lwage {c |}{res}      2,724    2.998441    .7807453  -7.640123   5.130689
{txt}{space 3}pot_exper {c |}{res}      2,937    26.59789    3.396389         17         44
{txt}pot_exper_sq {c |}{res}      2,937    718.9792    180.2603        289       1936
{txt}
{com}. 
. ###Q9###
{err}Unknown #command
{com}. reg lwage educ pot_exper pot_exper_sq male black hisp, r

{txt}Linear regression                               Number of obs     = {res}     2,724
                                                {txt}F(6, 2717)        =  {res}    94.65
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2108
                                                {txt}Root MSE          =    {res} .69433

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .1196995{col 26}{space 2} .0081024{col 37}{space 1}   14.77{col 46}{space 3}0.000{col 54}{space 4}  .103812{col 67}{space 3} .1355871
{txt}{space 3}pot_exper {c |}{col 14}{res}{space 2}-.0200236{col 26}{space 2} .0430486{col 37}{space 1}   -0.47{col 46}{space 3}0.642{col 54}{space 4}-.1044349{col 67}{space 3} .0643878
{txt}pot_exper_sq {c |}{col 14}{res}{space 2} .0004338{col 26}{space 2} .0007913{col 37}{space 1}    0.55{col 46}{space 3}0.584{col 54}{space 4}-.0011178{col 67}{space 3} .0019854
{txt}{space 8}male {c |}{col 14}{res}{space 2} .3620161{col 26}{space 2} .0269907{col 37}{space 1}   13.41{col 46}{space 3}0.000{col 54}{space 4} .3090917{col 67}{space 3} .4149405
{txt}{space 7}black {c |}{col 14}{res}{space 2}-.2636433{col 26}{space 2} .0482383{col 37}{space 1}   -5.47{col 46}{space 3}0.000{col 54}{space 4}-.3582308{col 67}{space 3}-.1690558
{txt}{space 8}hisp {c |}{col 14}{res}{space 2} -.077995{col 26}{space 2} .0585505{col 37}{space 1}   -1.33{col 46}{space 3}0.183{col 54}{space 4}-.1928029{col 67}{space 3}  .036813
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.387391{col 26}{space 2} .6333129{col 37}{space 1}    2.19{col 46}{space 3}0.029{col 54}{space 4}  .145567{col 67}{space 3} 2.629214
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ###Q11###
{err}Unknown #command
{com}. reg lwage educ pot_exper pot_exper_sq male black hisp afqt81 educ_mom educ_dad, r

{txt}Linear regression                               Number of obs     = {res}     2,370
                                                {txt}F(9, 2360)        =  {res}    60.88
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.2308
                                                {txt}Root MSE          =    {res} .69253

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}       lwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0676625{col 26}{space 2} .0108278{col 37}{space 1}    6.25{col 46}{space 3}0.000{col 54}{space 4} .0464296{col 67}{space 3} .0888954
{txt}{space 3}pot_exper {c |}{col 14}{res}{space 2} -.062427{col 26}{space 2} .0439923{col 37}{space 1}   -1.42{col 46}{space 3}0.156{col 54}{space 4}-.1486947{col 67}{space 3} .0238406
{txt}pot_exper_sq {c |}{col 14}{res}{space 2} .0009954{col 26}{space 2} .0008053{col 37}{space 1}    1.24{col 46}{space 3}0.217{col 54}{space 4}-.0005837{col 67}{space 3} .0025745
{txt}{space 8}male {c |}{col 14}{res}{space 2} .3416922{col 26}{space 2} .0289924{col 37}{space 1}   11.79{col 46}{space 3}0.000{col 54}{space 4}  .284839{col 67}{space 3} .3985454
{txt}{space 7}black {c |}{col 14}{res}{space 2}-.1165394{col 26}{space 2} .0598115{col 37}{space 1}   -1.95{col 46}{space 3}0.051{col 54}{space 4} -.233828{col 67}{space 3} .0007492
{txt}{space 8}hisp {c |}{col 14}{res}{space 2} .0093496{col 26}{space 2} .0665797{col 37}{space 1}    0.14{col 46}{space 3}0.888{col 54}{space 4}-.1212112{col 67}{space 3} .1399104
{txt}{space 6}afqt81 {c |}{col 14}{res}{space 2} .0050186{col 26}{space 2}  .000645{col 37}{space 1}    7.78{col 46}{space 3}0.000{col 54}{space 4} .0037538{col 67}{space 3} .0062834
{txt}{space 4}educ_mom {c |}{col 14}{res}{space 2} .0026239{col 26}{space 2} .0067863{col 37}{space 1}    0.39{col 46}{space 3}0.699{col 54}{space 4}-.0106838{col 67}{space 3} .0159316
{txt}{space 4}educ_dad {c |}{col 14}{res}{space 2} .0133643{col 26}{space 2} .0050393{col 37}{space 1}    2.65{col 46}{space 3}0.008{col 54}{space 4} .0034824{col 67}{space 3} .0232462
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 2.376432{col 26}{space 2} .6614628{col 37}{space 1}    3.59{col 46}{space 3}0.000{col 54}{space 4} 1.079324{col 67}{space 3} 3.673541
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. ###Q12###
{err}Unknown #command
{com}. corr educ afqt81
{txt}(obs=2,827)

             {c |}     educ   afqt81
{hline 13}{c +}{hline 18}
        educ {c |}{res}   1.0000
      {txt}afqt81 {c |}{res}   0.5774   1.0000

{txt}
{com}. corr afqt81 lwage
{txt}(obs=2,631)

             {c |}   afqt81    lwage
{hline 13}{c +}{hline 18}
      afqt81 {c |}{res}   1.0000
       {txt}lwage {c |}{res}   0.3835   1.0000

{txt}
{com}. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}\\tsclient\C\Users\tsblo\Google Drive\UT Spring 2019\Adv econimetrics\Problem_set_2_log.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}22 Feb 2019, 11:37:53
{txt}{.-}
{smcl}
{txt}{sf}{ul off}